![alt text](./assets/pandas_logo.jpg)



## Introduction to pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

## What is Pandas?

Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.


## Installing Pandas

When you want to work with pandas locally, you should run the following commands:

`pip install pandas`\
or\
`conda install pandas`

In our case, 4Geeks have prepared all the environment in order that you can work comfortably.

## Why use Pandas?

Pandas allows us to analyze big data and make conclusions based on statistical theories. It can clean messy data sets, and make them readable and relevant and clearly, relevant data is very important in data science.

But the main reason is Pandas allow you deal with a new structure of data: dataframes. A dataframe is a two-dimensional data structure in which data of different types (such as characters, integers, floating-point values, factors, and more) can be stored in columns. It is similar to an SQL spreadsheet or table of excels. A dataframe always has an index (starting at 0). The index refers to the position of an element in the data structure.

Pandas provides tools that allow:

- read and write data in different formats: CSV, Microsoft Excel, SQL databases and HDF5 format

- easily select and filter data tables based on position, value, or labels

- merge and join data

- time series manipulation

- make graphs (plots)

In pandas there are three basic types of objects, all of them based on Numpy:

- Series (lists, 1D),

- DataFrame (tables, 2D) and

- Panels (3D tables).

#### Exercise: Import the pandas package under the name `pd` (★☆☆)

To import a new library in python we have to use the import statement like this: `import <library_name> as <your_alias>`.

Use the `import` statement in python to import the pandas module under the alias pd. If you want to assert the library was correctly imported, remember you can print the version of any python library with: `name_of_package.__version__`

In [3]:
import pandas as pd

## Pandas data types

Pandas has three different data structures:

- Series: One-dimensional structure.
- DataFrame: Two-dimensional structure (tables).
- Panel: Three-dimensional structure (cubes and less used).

These structures are built from arrays from the NumPy library, adding new functionalities.


<img src="./assets/series_dataframe.png" width="600"/>

## Object creation

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [4]:
import numpy as np
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In the previous exercise, we have created a pandas series (a one-dimensional vector or array) from a list. In the following exercise, we ask you to create a one-dimensional vector but this time from other python structures.

#### Exercise: Create a pandas series from each of the items below: a list, numpy and a dictionary (★☆☆)

In [5]:
l1=[0,1,"ana"]
s1=pd.Series(l1)
l2=np.zeros(3)
s2=pd.Series(l2)
l3={"a":2,"b":4,"f":1}
s3=pd.Series(l3)
print(s3)

a    2
b    4
f    1
dtype: int64

#### Exercise: Now, try to create a dataframe of one column from a pandas series (★☆☆)

Check the function `to_frame` (https://pandas.pydata.org/docs/reference/api/pandas.Series.to_frame.html)

In [6]:
l=np.random.random(4)
s=pd.Series(l,name="nºs aleatorios")
s.to_frame()

   nºs aleatorios
0        0.937733
1        0.844086
2        0.307163
3        0.167318

#### Exercise: How to combine many series to form a dataframe? (★☆☆)
Create two series with names `ser1` and `ser2` to form a dataframe. That is, a two columns dataframe from the series `ser1` and `ser2`.

In [7]:
s1=pd.Series(np.random.random(4),name="ser1")
s2=pd.Series(np.random.randint(1,10,4),name="ser2")
pd.DataFrame({"a": s1,"ser2":s2})

          a  ser2
0  0.307236     7
1  0.420517     4
2  0.888053     5
3  0.650392     1

#### Exercise: How to get the items not common to both series A and series B? (★☆☆)
Extract the elements that are not in common of the series `ser1` and `ser2`we define below.
Check functions `union1d` and `intersect1d` from numpy. Yes, numpy (https://numpy.org/doc/stable/reference/generated/numpy.union1d.html and https://numpy.org/doc/stable/reference/generated/numpy.intersect1d.html). Remember that **numpy and pandas work together**

In [8]:
# Input

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8]) 

t=np.union1d(ser1,ser2)
c=np.intersect1d(ser1,ser2)

t[~np.isin(t,c)] #np.isin devolve o indice dos eltos da array t que se encontram em c

array([1, 2, 3, 6, 7, 8])

#### Exercise: How to convert a numpy array to a dataframe of given shape? (★☆☆)
Reshape a random series into a dataframe with 7 rows and 5 columns. In this exercise, you have to create a one-dimensional array of length 35 and then you will have to convert that array into a dataframe

In [9]:
l=pd.Series(np.random.random(35))
ll=l.values.reshape(7,5)   #series.values.reshape(m,n) reshape a series into a series of dimension mxn
pd.DataFrame(data=ll)

          0         1         2         3         4
0  0.923280  0.551702  0.259745  0.225401  0.519125
1  0.322202  0.230022  0.315625  0.019382  0.966134
2  0.370751  0.464000  0.594752  0.703701  0.246295
3  0.642874  0.145744  0.370929  0.049724  0.566025
4  0.357038  0.565825  0.776131  0.692855  0.277898
5  0.530567  0.420197  0.865991  0.246942  0.873889
6  0.690050  0.723046  0.768630  0.210565  0.595974

#### Exercise:  How to extract items at given positions from a series (★☆☆)
You can also create series and dataframe that contain strings. From the following pandas series `ser`, extract the items at positions in the list `pos`. Check `take`from pandas (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.take.html)

In [10]:
# Input

ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

#### Exercise:  How to stack two series vertically and horizontally ?
Create two series `ser1` and `ser2` and stack them vertically and horizontally (to form a dataframe). Check `concatenate`from pandas (https://pandas.pydata.org/docs/reference/api/pandas.concat.html)

In [11]:
s1=pd.Series(np.zeros(3),name="ser1")
s2=pd.Series(np.ones(3),name="ser2")
pd.concat([s1,s2],axis=0)
pd.concat([s1,s2],axis=0,ignore_index=True)

0    0.0
1    0.0
2    0.0
3    1.0
4    1.0
5    1.0
dtype: float64

#### Exercise: How to get the positions of items of series A in another series B? (★★☆)
Get the positions of items of ser2 in ser1 as a list. Remember the function `where`from numpy (https://numpy.org/devdocs/reference/generated/numpy.where.html)

In [12]:
## Input

ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3000, 10, 13]) 
np.nonzero(np.isin(ser2,ser1))

(array([0, 2, 3]),)

#### Exercise: How to compute difference of differences between consequtive numbers of a series? (★★☆)
Difference of differences between the consequtive numbers of `ser`.

In [13]:
## Input
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

a=np.roll(ser,1)
b=np.where(ser-a<0,np.nan,ser-a)
c=np.roll(b,1)
b-c

## Output should be like following
# [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
# [nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

array([nan, nan,  1.,  1.,  1.,  1.,  0.,  2.])

## Apply functions to a series
It is also possible to apply a function to each element of the series using the following method:

`s.apply(f)`: Returns a series with the result of applying the function f to each of the elements of the series s.

### Example
```
import pandas as pd
from math import log
s = pd.Series([1, 2, 3, 4])
s.apply(log)
```

#### Exercise: Convert all values of a pandas series of string to upper (★☆☆)
You have to create a series of strings with random values and then convert each string to capital letters.
Check upper in pandas (https://pandas.pydata.org/docs/reference/api/pandas.Series.str.upper.html)

In [14]:
import string

#letters = string.ascii_lowercase
#l=np.array((letters), dtype=str)
#k=[np.random.choice(l,size=10),np.random.choice(l,size=4),np.random.choice(l,size=6),np.random.choice(l,size=3)]
#a=pd.Series(k)
#print(k)
#a.str.upper()
#np.random.choice(letters)

#### Exercise: Get all values greater than 5 from a pandas series (★☆☆)
Remember that you can create series and dataframes from dictionaries. In this exercise you will have to get all values greater than 5.

In [192]:
## Input
s = pd.Series({'Math': 6.0,  'Economy': 4.5, 'Programming': 8.5})
#print(s-5*np.ones(3))
s.take(np.nonzero(np.where(s>5,s,0))[0])

Math           6.0
Programming    8.5
dtype: float64

#### Exercise: Sort a series. Sort the series from the previous exercise in both, ascending and descendant order (★ ☆☆)
The following methods are used to sort a series:

`s.sort_values (ascending = Boolean)`: Returns the series that results from ordering the values in the series s. If the argument of the ascending parameter is True the order is increasing and if False it is decreasing.

`df.sort_index (ascending = Boolean)`: Returns the series that results from sorting the index of the series s. If the argument of the ascending parameter is True the order is increasing and if it is False decreasing.

In [195]:
print(s.sort_values(ascending=True))
s.sort_values(ascending=False)

Economy        4.5
Math           6.0
Programming    8.5
dtype: float64

Programming    8.5
Math           6.0
Economy        4.5
dtype: float64

#### Exercise: Eliminate the unknown (`NA`) values in a series.  Drop the NAs values from the series
Unknown data is represented in Pandas by `NaN` and `null` by `None`. Both are usually a problem when performing some data analysis, so it is common to eliminate them. To remove them from a series the following method is used:

s.dropna (): Removes the unknown or null data from the s series.

In [196]:
## Input
import pandas as pd
import numpy as np
s = pd.Series(['a', 'b', None, 'c', np.NaN,  'd'])
s.dropna()

0    a
1    b
3    c
5    d
dtype: object

## The DataFrame object class

An object of type DataFrame defines a set of data structured in the form of a table where each column is an object of type Series, that is, all the data in the same column are of the same type, and the rows are records that can contain data from Different types.

A DataFrame contains two indexes, one for the rows and one for the columns, and its elements can be accessed by the names of the rows and columns.

Example. The following DataFrame contains information about the students in a course. Each row corresponds to a student and each column to a variable.

![alt text](./assets/df.png "df")

## Creating a DataFrame from a CSV or Excel file
Depending on the type of file, there are different functions to import a DataFrame from a file.

- read_csv: Returns an object of type DataFrame with the data from the CSV file file.csv using as separator of the data the string separator.

- read_excel: Returns an object of type DataFrame with the data from the spreadsheet sheet of the Excel file file .xlsx.

## The Titanic dataset 
The titanica dataset is a famous and "funny" dataset in the area of data science. It is commonly used for beginners in order to know how to fit a machine learning model. The competition is simple: use machine learning to create a model that predicts which passengers survived the Titanic shipwreck.

The dataset consists of the following variables.


| Variable | Definition                                 | Key                                            |
|----------|--------------------------------------------|------------------------------------------------|
| survival | Survival                                   | 0 = No, 1 = Yes                                |
| pclass   | Ticket class                               | 1 = 1st, 2 = 2nd, 3 = 3rd                      |
| sex      | Sex                                        |                                                |
| Age      | Age in years                               |                                                |
| sibsp    | # of siblings / spouses aboard the Titanic |                                                |
| parch    | # of parents / children aboard the Titanic |                                                |
| ticket   | Ticket number                              |                                                |
| fare     | Passenger fare                             |                                                |
| cabin    | Cabin number                               |                                                |
| embarked | Port of Embarkation                        | C = Cherbourg, Q = Queenstown, S = Southampton |


In the following exercise you will have to get some insights about this dataset. An insight is a just derived information you can get from a dataset like the mean of age for example.

#### Exercise: Read the data `titanic_train.csv` located in the assets folder (★☆☆)

In [181]:
pd.read_csv('./assets/titanic_train.csv')
#print(a)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

#### Exercise: File export. Export the previous data frame separated by semicolon (;) and name it as "`your_name.txt`" (★☆☆)
There are also functions to export a DataFrame to a file with different formats.

- `df.to_csv (file.csv, sep = separator, columns = Boolean, index = Boolean)`: Exports the DataFrame df to the file file.csv in CSV format using the separator string as data separator.
- `df.to_excel (file.xlsx, sheet_name = sheet, columns = Boolean, index = Boolean)`: Exports the DataFrame df to the spreadsheet sheet of the file file.xlsx in Excel format.

In [198]:
a=pd.read_csv('./assets/titanic_train.csv')
a.to_csv('ivo.txt')

## Attributes of a DataFrame
There are several properties or methods for viewing the characteristics of a DataFrame.

- `df.info()`: Returns information (number of rows, number of columns, indexes, type of columns and used memory) about the DataFrame df.

- `df.shape`: Returns a tuple with the number of rows and columns of the DataFrame df.

- `df.size`: Returns the number of elements in the DataFrame.

- `df.columns`: Returns a list with the names of the columns of the DataFrame df.

- `df.index`: Returns a list with the names of the rows in the DataFrame df.

- `df.dtypes`: Returns a series with the data types of the columns of the DataFrame df.

- `df.head(n)`: Returns the first n rows of the DataFrame df.

- `df.tail(n)`: Returns the last n rows of the DataFrame df.

#### Exercise: Read the dataframe exported as "`your_name.txt`" and print all the previous attributes taking `n = 10` (★☆☆)

In [19]:
a=pd.read_csv('ivo.txt')
a.head(10)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

#### Exercise: Change the name of columns of the above data frame using two different methos (★★☆) 
Check the function `rename` (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rename.html) and remember you can get the name of columns using `df.columns`

In [25]:
#a.rename(columns={"Name":"NAME!!"})
a.rename(lambda x: x+"!", axis='columns')

,Unnamed: 0!,PassengerId!,Survived!,Pclass!,Name!,Sex!,Age!,SibSp!,Parch!,Ticket!,Fare!,Cabin!,Embarked!
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### Exercise: Change the index of the above data frame using two different methos (★★☆) 
Check `iloc` (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html)

#### Exercise: Get the position (3,5) from the dataframe `your_name.txt`  (★☆☆)

In [40]:
a.iloc[3,5]

'female'

#### Exercise: Get the 10-th value from the column "Ticket" from the dataframe `your_name.txt`  (★☆☆)

In [42]:
a["Ticket"][9]

'237736'

#### Exercise: Add columns to a DataFrame. Create a random array and a random list and add them to the dataframe coming from  `your_name.txt` (★☆☆)
The procedure for adding a new column to a DataFrame is similar to adding a new pair to a dictionary, but passing the column's values in a list or series.

In [47]:
a["random"]=np.random.random(len(a))
a

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,random
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.667277
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0.215308
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.576236
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0.916248
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.603752
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.901031
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0.200697
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.903727
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0.501230
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.584840

#### Exercise: Create or subset a data frame. Subset the dataframe coming from `your_name.txt` by Male registers using two different methods (★★☆)
Remember the function `where` from `numpy`

In [79]:
a[a["Sex"]=="male"]
a.iloc[np.where(a["Sex"]=="male")]

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,random
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.667277
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.603752
5,5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0.917808
6,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0.321451
7,7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,0.336852
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S,0.413958
884,884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,0.172692
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.901031
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0.501230
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.584840

## Descriptive summary of a DataFrame
As for strings, the following methods allow you to summarize the information in a DataFrame by columns:

- `df.count()`: Returns a series number of elements that are not null or NaN in each column of the DataFrame df.
- `df.sum()`: Returns a series with the sum of the data of the columns of the DataFrame df when the data is of a numeric type, or the concatenation of them when they are of the string type str.
- `df.cumsum()`: Returns a DataFrame with the cumulative sum of the data in the columns of the DataFrame df when the data is of a numeric type.
- `df.min()`: Returns a series with the minors of the data of the columns of the DataFrame df.
- `df.max()`: Returns a series with the largest of the data in the columns of the DataFrame df.
- `df.mean()`: Returns a series with the mean of the data in the columns of the DataFrame df when the data is of a numeric type.
- `df.std()`: Returns a series with the standard deviations of the data in the columns of the DataFrame df when the data is of a numeric type.
- `df.describe(include = type)`: Returns a DataFrame with a statistical summary of the columns of the DataFrame df of type type. For numerical data(number), the mean, standard deviation, minimum, maximum and quartiles of the numeric columns are calculated. For non-numeric data(object) the number of values, the number of distinct values, the mode and their frequency are calculated. If the type is not indicated, only the numeric columns are considered.

#### Exercise: Make a description of the dataset `your_name.txt` (★☆☆)

In [184]:
a.mean()
a.describe(include=type)

/tmp/ipykernel_1262/3124034692.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  a.mean()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

#### Exercise: Remove the column Ticket from your dataframe (★☆☆)

In [87]:
a.drop(columns="Ticket")

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,random
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S,0.667277
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,0.215308
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S,0.576236
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,0.916248
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S,0.603752
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S,0.901031
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S,0.200697
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S,0.903727
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,0.501230
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q,0.584840

#### Exercise: Sort the dataframe by the Age column  (★★☆)
Check the functions `df.sort_values` and `df.sort_index`

In [83]:
a["Age"].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

#### Exercise: Drop the rows of your dataframe that contain na values (★★☆)

In [200]:
a.dropna()

     PassengerId  Survived  Pclass  ...     Fare        Cabin  Embarked
1              2         1       1  ...  71.2833          C85         C
3              4         1       1  ...  53.1000         C123         S
6              7         0       1  ...  51.8625          E46         S
10            11         1       3  ...  16.7000           G6         S
11            12         1       1  ...  26.5500         C103         S
..           ...       ...     ...  ...      ...          ...       ...
871          872         1       1  ...  52.5542          D35         S
872          873         0       1  ...   5.0000  B51 B53 B55         S
879          880         1       1  ...  83.1583          C50         C
887          888         1       1  ...  30.0000          B42         S
889          890         1       1  ...  30.0000         C148         C

[183 rows x 12 columns]

#### Exercise: Subset the rows where Age values are greater than 18 (★★☆)

In [101]:
a[a["Age"]>18]

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,random
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.667277
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0.215308
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.576236
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0.916248
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.603752
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,0.507414
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.901031
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0.200697
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0.501230
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.584840

#### Exercise: Subset the rows where Age values are greater than 18 and less than 5 and get the number of rows  (★★☆)

In [189]:
a[(a["Age"]>18) | (a["Age"]<5)]
len(a[(a["Age"]>18) | (a["Age"]<5)])

615

#### Exercise: Normalize the column Age (★★☆)
Remember from probability (https://en.wikipedia.org/wiki/Normalization_(statistics)) that :

$$ x_{norm} = \frac{x - \bar{x}}{\sigma}$$

In [109]:
a["Age"]=(a["Age"]-np.mean(a["Age"])*np.ones(len(a)))/np.std(a["Age"])

#### Exercise: Consider two random array A and B, check if they are equal (★★☆)

In [129]:
a=np.random.randint(1,10,(1,3))
b=np.random.randint(1,10,(1,3))
print(a,b)
np.all(a==b)

[[5 2 5]] [[7 3 5]]

False

#### Exercise: How to set the number of rows and columns displayed in the output? (★★★)
Check the function `set_option` from pandas

In [133]:
pd.set_option('display.max_rows', 4)
pd.set_option('display.max_columns', 6)
pd.read_csv('ivo.txt')

     Unnamed: 0  PassengerId  Survived  ...     Fare Cabin Embarked
0             0            1         0  ...   7.2500   NaN        S
1             1            2         1  ...  71.2833   C85        C
..          ...          ...       ...  ...      ...   ...      ...
889         889          890         1  ...  30.0000  C148        C
890         890          891         0  ...   7.7500   NaN        Q

[891 rows x 13 columns]

#### Exercise: How to join two dataframes by 2 columns so they have only the common rows? (★★★)
Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.

In [167]:
## Input

df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

frames = [df1, df2]
pd.set_option('display.max_rows', 20)
pd.set_option('display.max_columns', 6)
  
df2.rename(columns={"pazham":"fruit","kilo":"weight"}, inplace=True)
df3=pd.concat([df1,df2])
df3.reset_index(drop=True, inplace=True)
df3.rename(columns={"fruit":"fruit/pazham","weight":"weight/kilo"}, inplace=True)
df3

   fruit/pazham weight/kilo  price
0         apple        high     13
1        banana      medium     10
2        orange         low      1
3         apple        high     14
4        banana      medium      3
5        orange         low     13
6         apple        high      0
7        banana      medium      6
8        orange         low      0
9         apple        high      0
10       orange         low     14
11         pine        high     10
12        apple         low      8
13       orange        high      8
14         pine         low     10

#### Exercise: How to get the positions where values of two columns match? (★★★)
Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.

In [178]:
## Input
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})
df[df["fruit1"]==df["fruit2"]]
#df["fruit1"]

   fruit1  fruit2
0  banana  banana
2   apple   apple
3   apple   apple
6   apple   apple